#+STARTUP: overview
#+VISIBILITY: folded
#+begin_src emacs-lisp
  (setq
       bookmark-save-flag 1
       doom-font (font-spec :family (if (eq system-type 'darwin) "Menlo" "DejaVu Sans Mono")
                            :size 14 :weight 'medium)
       ;; doom-theme 'doom-tomorrow-night
       confirm-kill-emacs nil

  )
  (add-to-list 'default-frame-alist '(inhibit-double-buffering . t))

  ;; Noctalia theme (generated by noctalia-shell user template)
  (add-to-list 'custom-theme-load-path "~/.local/share/noctalia/emacs-themes/")
  (add-hook 'after-init-hook (lambda () (ignore-errors (load-theme 'noctalia t))))
  ;; (set-frame-parameter (selected-frame) 'alpha '(97 . 93))
  ;; (setq! +lookup--last-provider '((fundamental-mode . "Google") (org-mode . "Google") (rust-mode . "Google") (rustic-mode . "Google")))
#+end_src

** yabai
#+begin_src emacs-lisp
(start-process "yabai" nil "yabai" "-m" "window" "--focus" "south")
#+end_src

#+RESULTS:
: #<process yabai>

#+begin_src emacs-lisp
(defun yabai-move-on-error (direction move-fn)
  (interactive)
  (condition-case nil
      (funcall move-fn)
    (user-error (start-process "yabai" nil "yabai" "-m" "window" "--focus" direction))))


(defun yabai-window-left ()
  (interactive)
  (yabai-move-on-error "west" #'windmove-left))

(defun yabai-window-right ()
  (interactive)
  (yabai-move-on-error "east" #'windmove-right))

(defun yabai-window-up ()
  (interactive)
  (yabai-move-on-error "north" #'windmove-up))

(defun yabai-window-down ()
  (interactive)
  (yabai-move-on-error "south" #'windmove-down))
#+end_src

#+RESULTS:
: yabai-window-down

